// Константа JavaScript веде себе як звичайна змінна оголошена за допомогою let
// c єдиною відмінністю - її значення не можна змінювати після оголошення.

// Оголосити константу ми можемо з допомогою ключового слова 'const';

const admin = 'John';



// Значення константи не можна перевизначити після ініціалізації, якщо спробуємо це зробити
// то двигун JS викине помилку, яку ми зможемо вивчити в консолі.

// admin = 'Alice';     // Помилка!



// Важливо зауважити що як у прикладі з let так і з const імена констант, змінних та функцій
// у області видимості що неспроможні збігатися друг з одним. Про області видимості ми
// поговоримо наступних уроках.

const user = 100;
// let user = 200;   // Помилка!


// Приклад неправильного використання констант

// const age;
// age = 10    // Помилка!

// Оскільки age це константа, ми можемо її перевизначити, отже пам'ять буде
// займати з невизначеним значенням.


// Навіщо потрібні константи?

// Вони існують у тому щоб зберігати дані які будь-коли змінюватися.
// у вашому коді може бути визначена велика кількість змінних і констант, щоб
// убезпечити себе від випадкової зміни значення, яке ми, насправді, не хотіли
// б змінювати і запобігти неявним помилкам у нашому коді ми можемо використовувати константи.

// Також вони існують для того, щоб зберігати даний налаштування нашого проекту, які можуть
// бути відомі нам заздалегідь і яких залежить поведінка нашого проекту.

const API_URL = 'https://api-url.com/posts/';
