// Змінна - це іменоване сховище даних, ми можемо використовувати її для
// зберігання інформації. Наприклад: ім'я користувача, вік користувача тощо.
//
// Для визначення змінної ми можемо використати ключове слово let або var

// Good
let user = 'John';

// Bad
var age = 10;

// Оголошення змінних за допомогою ключового слова var є застарілим способом
// та його не рекомендується використовувати. У наступних уроках ми розберемося з цією темою,
// вона більш складна, ніж це може здатися на перший погляд.

// Поки що зосередимося на let.

// Для того, щоб записати дані в змінну, ми можемо використовувати оператор '=' .
// '=' - це оператор присвоєння.

let dog = 'Pete';

// Для рядка 'Pete' виділиться область у пам'яті пов'язана зі змінною, таким чином ми
// зможемо отримати її значення на ім'я змінної.

console.log(dog);

// Аналогічно як і всім раніше оголошеним.

console.log('user:', user);
console.log('age', age);


// Також ми можемо використовувати оператор ',' для того, щоб оголосити відразу кілька
// змінних.

let a = 10, b = 20, c = 30;

// Це не дуже хороший підхід, тому що такий код погано читається, якщо вам потрібно оголосити
// відразу кілька змінних робіть це з нового рядка.

let foo = 100;
let bar = 200;
let baz = 300;

// Це найзручніший спосіб і з таким кодом зазвичай не виникає проблем.


// Бувають такі ситуації, що значення змінних під час виконання скрипту можуть змінюватися.
// Якщо ви оголосили змінну за допомогою ключового слова let та визначили її значення
// ви також можете змінити її значення для цього, але для цього вже не потрібно вказувати let
// оскільки let служить лише оголошення змінної.

let student = 'John Dou';
console.log(student)    // John Dou

student = 'Alice Cooper';
console.log(student)    // Alice Cooper

// Готово, ви вдало змінили значення змінної.


// Важливо розуміти, якщо ви спробуєте повторно визначити змінну, яка вже існує
// dи отримаєте помилку.

let teacher = 'Vova Shaitan';
// let teacher = 'Alice Cooper';       // Ця інструкція викине помилку в консоль
