
// При назві змінних нам необхідно дотримуватися певних правил:

// 1. Ім'я змінної повинно містити лише літери, цифри або символи $ та _.

let user = 'John';
let $user = 'Alice';
let _user = 'Pete';
let user2 = 'Antony';
let u2s3e4r = 'Alex';       // Так краще не робити, але це працюватиме


// 2. Перший символ імені не повинен бути цифрою.

// let 10user = 'Nick';     // Помилка!


/*
3. Імена змінних мають бути написані на латиниці.
   Ви звичайно можете називати змінні на кирилиці, а також будь-якою іншою мовою
   крім англійської, але це вважається поганою практикою.
 */

let mentor = 'John Doe';            // Good
let ментор  = 'Alice Cooper';       // Bad


// 4. Ім'я змінної має відображати сенс того, що вона зберігає.

let age = 20;
let color = 'red';
let sum = 10 + 10;
let salary = '0$';


// Як бути якщо ім'я змінної має складатися з кількох слів?
// Насправді є багато стилів іменування змінних
// Наприклад:

let snake_case = 'Слів пишуться без пробілів, замість пробілу використовується символ _';
let PascalCase = 'Слова пишуться без прогалин і все з великої літери';
let camelCase = 'Слова пишуться без прогалин, починаючи з другого слова всі пишуться з великої літери';

// let kebab-case = 'Слов пишуться без прогалин, замість пробілу використовується символ -';

// У JS викликає помилки так як символ '-' не дозволений для використання в
// Іменах змінних, також kebab-case ще називаю шашличним регістром.

// При написанні коду на JavaScript ми в основному використовуємо camelCase,

let userAge = 20;

let userFirstName = 'John';
let userLastName = 'Doe';
let userFullName = userFirstName + ' ' + userLastName;

let userSuperLongVariableName = 'Value';


//Константи

// Все вищеперелічене чудово підходь і для іменування констант.
// але також, іноді, для значень, що важко запам'ятовуються, які відомі ще до початку
// виконання скрипта, константи називають у верхньому регістрі використовуючи snake_case.

const API_URL = 'https://api.url/posts';
const DATABASE_NAME = 'databese_name_db';
const COLOR_WHITE = '#ffffff';
const COLOR_BLACK = '#000000';
