'use strict';
// Вихід з циклу: "break"

// Ми можемо вийти з циклу будь-якої миті за допомогою спеціальної директиви break.

let sum = 0;

while (true) {
    let value = +prompt("Введіть число", '');

    if (!value) break;

    sum += value; // sum = sum + value
}

alert( 'Сумма: ' + sum );


// Директива break у рядку 13 повністю припиняє виконання циклу та передає
// Управління на рядок за його тілом, тобто на alert.


// Не можна використовувати break праворуч від тернарного оператора (? - Знак питання)
