'use strict';
// Перехід до наступної ітерації: continue

// При виконанні директиви continue цикл не переривається,
// а переходить до наступної ітерації

// % - залишок від поділу, завжди при парних числах видасть 0

for (let i = 0; i < 10; i++) {

    // якщо true, пропустити частину тіла циклу, що залишилася
    if (i % 2 === 0) {
        continue; // reverse !==
    }

    console.log(i); // 1, потім 3, 5, 7, 9
}

// Не можна використовувати break праворуч від
// тернарного оператора (? - Знак питання)
