// for cycle syntax

// for (початок; умова; крок) {
//     // ... тіло циклу ...
// }

// Приклад 1
// const names = [
//     'John', 'Alice', "Donald", 'Dog'
// ]
//
//
// for (let i = 0; i <= 3; i++) {
//     console.log(i);
// }

// console.log(i) // error

// Частини циклу for
// початок	i = 0	    Виконується один раз при вході в цикл
// умова	i < 3	    Перевіряється перед кожною ітерацією циклу. Якщо воно обчислиться false, цикл зупиниться.
// крок	    i++	        Виконується після тіла циклу кожної ітерації перед перевіркою умови.
// тіло	    alert(i)	Виконується знову і знову, доки умова обчислюється в true.



// Пропускаємо частини «for» циклу

// let i = 0;           // ми вже маємо оголошену i з наданим значенням
//
// for (; i < 3; i++) {         // немає необхідності в "початку"
//     console.log(i);        // 0, 1, 2
// }
//
// console.log('Output: ', i)  // 3


// Можна прибрати і крок:
// let i = 0;
//
// for (; i < 3;) {
//     console.log(i++);
// }
//
// console.log('Output: ', i)


// Можна прибрати все
// let i = 0;
//
// for (;;) {
//
//     if(i % 2 === 0) {
//         console.log('Парне: ', i);
//     } else {
//         console.log('Не парне: ', i);
//     }
//
//     if(i >= 10) {
//         break;
//     }
//
//     i++;
// }
//
// console.log('Hello world!')
