// Мітки для break і continue

let sum = 0;

outerLoop: // мітка для зовнішнього циклу
    for (let i = 1; i <= 5; i++) {

        for (let j = 1; j <= 5; j++) {
            sum = i + j;
            console.log(`i = ${i}, j = ${j}, sum = ${sum}`);

            if (sum >= 10) {
                break outerLoop; // перериває зовнішній цикл
            }

        }


    }


alert('Готово!');


// Мітки не дозволяють передавати управління в довільне місце коду.
// Виклик break/continue можливий лише всередині циклу,
// і мітка має бути десь вище цієї директиви.


