'use strict';

/* Суворий режим JavaScript говорить браузеру що йому потрібно інакше виконувати код
в строгому режимі інтерпретатор JavaScript:

1. Викидатиме помилки в тих місцях де в "звичайному" він їх спокійно пропускав

2. Також строгий режим виправляє деякі помилки, які заважали движкам JavaScript
виконувати оптимізацію

3. Також строгий режим забороняє використовувати деякі елементи синтаксису які в
подальші реалізації та оновлення стандарту EcmaScript будуть мати інший сенс.

Суворий режим можна увімкнути як для всього сценарію. Приклад на 1 рядку файлу.
У такому випадку весь решта коду пишеться під рядком 'use strict'.

Також строгий режим можна увімкнути окремо для функції. У такому разі 'use strict'
повинен бути підключений на самому початку функції.
*/

function foo(a, b) {
    'use strict';

    return a * b;
}

console.log(
    foo(10, 2)
);

/*
Якщо весь скрипт працює в строгому режимі, немає сенсу вмикати його окремо для функції.
Так можна робити тільки якщо весь скрипт працює у звичайному режимі, але ви хочете щоб
ваша функція працювала у строгому.

Якщо перед інструкцією 'use strict'; є якийсь інший код вона не працюватиме.

Також 'use strict'; режим за замовчуванням на рівні модулів, про модулі та функції ми будемо
говорити на наступних уроках.

"Звичайний режим" працює за замовчуванням, якщо не включений строгий 'use strict'; режим.
*/
