'use strict';
// Коментування - потрібно використовувати для опису того, як працює код і чому
// або для того, щоб прибрати шматок коду з інтерпретації, браузер не виконує коментарів

// Однорядковий коментар!


/*
    Багаторядковий коментар
    виглядає так!
 */


// Інструкції та читабельність коду

// Погано читається
console.log('Hello from condole!'); alert('Hello form alert window');


// Добре читається
console.log('Hello from condole!');
alert('Hello form alert window');


/*
Крапка з комою

Незважаючи на те, що JavaScript при інтерпретації автоматично вставляє крапку з комою
при кожному перенесенні рядка, в деяких випадках цього не відбувається, щоб не
Зіткнутися такими помилками рекомендую завжди ставити "точку з комою".
*/
