// Базові функції для взаємодії з користувачем

/*
    Функція alert() в JavaScript є простим способом вивести повідомлення користувачу у
    вигляді модального діалогового вікна.
*/

// alert('Hello world')

/*
    Функція prompt() в JavaScript використовується для відображення діалогового вікна
    з текстовим полем, де користувачі можуть ввести рядок.
*/

// const age : string = prompt(message: 'Введіть ваш вік');
// const age = prompt('Введіть ваш вік');
//
// console.log(age);
// prompt('Введіть ваш вік', 10)

/*
    Функція confirm() в JavaScript використовується для відображення діалогового вікна
    з повідомленням та двома кнопками: "OK" та "Скасувати".
*/

// const age = confirm('Чи є вам 18 років?')
// console.log(age);