// Усі мови програмування містять вбудовані типи даних,
// але вони часто відрізняються одна від одної в різних мовах.
// На цьому уроці ми розберемося що таке типи даних і для чого вони потрібні.


// JavaScript є слабо типізованою або, як частіше кажуть, динамічною мовою.
// Це означає, що вам не потрібно визначати тип змінної заздалегідь.
// Тип визначиться автоматично під час виконання програми. Також це означає,
// що ви можете використовувати одну змінну для зберігання даних різних типів.

//Стандарт ECMAScript визначає 8 типів:

// Undefined (Невизначений тип)
// Boolean (Булевий, Логічний тип)
// Number (Число)
// String (Рядок/ строка)
// BigInt
// Symbol
// Null - Спеціальний примітив, який використовується не тільки для даних,
// але і як покажчик на фінальну точку в Ланцюжку Прототипів
// Object (Об'єкт) - Проста структура, яка використовується не тільки для зберігання даних,
// а й для створення інших структур

//Про всі типи даних ми поговоримо далі в цьому уроці
