// Array

/*
    array - масив даних, а також ітерований об'єкт, також належить до типу даних
    object.

    Ключі для елементів масиву створюються автоматично і є індексами, позицією
    елемента всередині масиву. Індексування масиву починається з нуля.
 */

const arr = ['John', 'Alice', 'Andrew', 'Antony'];

console.log(arr)


// У масиву є довжина (length), ця властивість містить кількість елементів масиву.

// console.log(arr.length);



// Беремо елементи за їхнім індексом

console.log(
    arr[0], arr[1], arr[2], arr[3]
)


// Якщо ми хочемо гарантовано отримати значення останнього елемента в масиві.

console.log(
    arr[arr.length - 1]
)


// У цьому уроці ми не будемо занурюватися в масиви та їхню роботу повністю, на даний
// момент варто знати що масиви теж належать до типу даних object
